argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V.
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other
  *    contributors to this software may be used to endorse or promote products
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under
  *    this license is void and will automatically terminate your rights under
  *    this license.
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "lwip.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <stm32746g_discovery_qspi.h>
#include <stm32746g_discovery.h>
#include <stm32f7xx_hal_rng.h>
    
#include "bsp_driver_sd.h"

#include <stdio.h>
#include <stdarg.h>
#include <string.h>
#include "sprintf.h"

#include "lwip/api.h"

#include "jsmn.h"
#include "lwhttp.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* Enable/Disable usage for FatFs mkfs function */
// #define USE_FATFS_MKFS 0

#define MAX_DHCP_TRIES  4

#define DBG_LWIP_ENABLED  1
#define DBG_RTOS_ENABLED  2
#define DBG_FATFS_ENABLED 4
#define DBG_QUEUE_ENABLED 8
#define DBG_JSMN_ENABLED  16
#define DBG_DHCP_ENABLED  32

const uint8_t bg_enabled = 0xFF;

#define DBG_PRINT_MSG(label, fnc, msg, err, txt) 
#define DBG_PRINT_ERR(label, fnc, msg, err, txt) //cli_printf("$$$ [%s] %s --> %s (ERR = %d)\r\n", label, fnc, msg, *err)
#define DBG_PRINT_TXT(label, fnc, msg, err, txt) //cli_printf("$$$ [%s] %s --> %s: %s\r\n", label, fnc, msg, txt)
#define DBG_PRINT_ALL(label, fnc, msg, err, txt) //cli_printf("$$$ [%s] %s --> %s: %s (ERR = %d)\r\n", label, fnc, msg, txt, *err)

#define  DBG_LWIP(msg, val, txt) debug_print(DBG_LWIP_ENABLED,  (char*)"LWIP",  __FUNCTION__, (char*)msg, (int8_t*)val, (char*)txt);
#define DBG_FATFS(msg, val, txt) debug_print(DBG_FATFS_ENABLED, (char*)"FatFs", __FUNCTION__, (char*)msg, (int8_t*)val, (char*)txt);
#define  DBG_RTOS(msg, val, txt) debug_print(DBG_RTOS_ENABLED,  (char*)"RTOS",  __FUNCTION__, (char*)msg, (int8_t*)val, (char*)txt);
#define DBG_QUEUE(msg, val, txt) debug_print(DBG_QUEUE_ENABLED, (char*)"QUEUE", __FUNCTION__, (char*)msg, (int8_t*)val, (char*)txt);
#define  DBG_JSMN(msg, val, txt) debug_print(DBG_JSMN_ENABLED,  (char*)"JSMN",  __FUNCTION__, (char*)msg, (int8_t*)val, (char*)txt);
#define  DBG_DHCP(msg, val, txt) debug_print(DBG_DHCP_ENABLED,  (char*)"DHCP",  __FUNCTION__, (char*)msg, (int8_t*)val, (char*)txt);


#define JSMN_MAX_TOK (128)

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CRC_HandleTypeDef hcrc;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

QSPI_HandleTypeDef hqspi;

RNG_HandleTypeDef hrng;

RTC_HandleTypeDef hrtc;

SD_HandleTypeDef hsd1;
DMA_HandleTypeDef hdma_sdmmc1_rx;
DMA_HandleTypeDef hdma_sdmmc1_tx;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

osThreadId defaultTaskHandle;
osThreadId buttonTaskHandle;
osThreadId ledTaskHandle;
osThreadId sdTaskHandle;
osThreadId lwipTaskHandle;
osThreadId dhcpTaskHandle;
osMessageQId buttonQueueHandle;
osMessageQId ledQueueHandle;
osMessageQId tcpQueueHandle;
osMessageQId logQueueHandle;
osMessageQId dumpQueueHandle;
osMessageQId getIPQueueHandle;
osMessageQId setIPQueueHandle;
osMessageQId cliLoggerQueueHandle;
osSemaphoreId cliBinarySemHandle;
/* USER CODE BEGIN PV */

osThreadId httpClientTaskHandle;
osThreadId httpServerTaskHandle;
osThreadId SDLoggerTaskHandle;
osThreadId CLILoggerTaskHandle;

FATFS SDFatFs;  /* File system object for SD card logical drive */

FIL HTTP_File;     /* File object */

char cli_buff[512];

uint8_t DHCP_state = DHCP_OFF;

const char* sd_log_filename = "sdlog.TXT";

/* USER CODE END PV */

