argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /*Configure GPIO pins : ARDUINO_A4_Pin ARDUINO_A5_Pin ARDUINO_A1_Pin ARDUINO_A2_Pin 
                           ARDUINO_A3_Pin */
  GPIO_InitStruct.Pin = ARDUINO_A4_Pin|ARDUINO_A5_Pin|ARDUINO_A1_Pin|ARDUINO_A2_Pin 
                          |ARDUINO_A3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_A0_Pin */
  GPIO_InitStruct.Pin = ARDUINO_A0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(ARDUINO_A0_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : DCMI_HSYNC_Pin PA6 */
  GPIO_InitStruct.Pin = DCMI_HSYNC_Pin|GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF13_DCMI;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_PWM_D6_Pin */
  GPIO_InitStruct.Pin = ARDUINO_PWM_D6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF9_TIM12;
  HAL_GPIO_Init(ARDUINO_PWM_D6_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_MISO_D12_Pin ARDUINO_MOSI_PWM_D11_Pin */
  GPIO_InitStruct.Pin = ARDUINO_MISO_D12_Pin|ARDUINO_MOSI_PWM_D11_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void debug_print(uint8_t dbg_mask, char* label, const char* fnc, char* msg, int8_t* val, char* txt)
{
  if (0 < (dbg_mask & bg_enabled)) {
    if (NULL != msg) {
      if ((NULL != val) && (NULL != txt)) {
        cli_printf("[%s] %s --> %s: %s (val = %d)\r\n", label, fnc, msg, txt, *val);
      } else if (NULL != val) {
        cli_printf("[%s] %s --> %s (val = %d)\r\n", label, fnc, msg, *val);
      } else if (NULL != txt) {
        cli_printf("[%s] %s --> %s: %s\r\n", label, fnc, msg, txt);
      } else {
        cli_printf("[%s] %s --> %s\r\n", label, fnc, msg);
      }
    }
  }
}

uint16_t cli_dump(const char* src, uint16_t len)
{
  if (xSemaphoreTake(cliBinarySemHandle, portMAX_DELAY) == pdTRUE)
  {
    cli_write(src, len);
    xSemaphoreGive(cliBinarySemHandle);
  }
}

uint16_t cli_write(const char* src, uint16_t len)
{
  const uint32_t ulTimeout = 3000UL;

  if ((src != NULL) && (len > 0))
  {
    HAL_UART_Transmit(&huart1, (uint8_t*)src, len, ulTimeout);
    // HAL_UART_Transmit(&huart6, (uint8_t*)src, len, 100);
  }

  return len;
}

#if 0
uint16_t cli_printf(const char* fmt, ...)
{
  uint16_t len = 0;
  va_list args;
  va_start(args, fmt);
  vsnprintf(cli_buff, sizeof(cli_buff), fmt, args);
  // tfp_vsnprintf(cli_buff, sizeof(cli_buff), fmt, args);
  len = cli_write(&cli_buff[0], strlen(cli_buff));
  va_end(args);    

  return len;
}
#endif

#define CLI_LOGGER_MAX_MESSAGE_LENGTH (128)

uint16_t cli_printf(const char * fmt, ...)
{
  size_t xLength = 0;
  va_list args;
  char * pcPrintString = NULL;

  /* The queue is created by xLoggingTaskInitialize().  Check
   * xLoggingTaskInitialize() has been called. */
  configASSERT(cliLoggerQueueHandle);

  /* Allocate a buffer to hold the log message. */
  pcPrintString = (char*)pvPortMalloc(CLI_LOGGER_MAX_MESSAGE_LENGTH);

  if(pcPrintString != NULL)
  {
    /* There are a variable number of parameters. */
    va_start( args, fmt );

    xLength = vsnprintf(pcPrintString, CLI_LOGGER_MAX_MESSAGE_LENGTH, fmt, args);

    va_end( args );

#if 0
    if(xLength < 0)
    {
      xLength = 0;
    }

    /* Add NULL terminator at the end */
    if(xLength < CLI_LOGGER_MAX_MESSAGE_LENGTH)
    {
      pcPrintString[xLength] = '\0';
    }
#endif

    /* Only send the buffer to the logging task if it is not empty. */
    if(xLength > 0)
    {
        /* Send the string to the logging task for IO. */
        if(xQueueSend(cliLoggerQueueHandle, &pcPrintString, 0) != pdPASS)
        {
            /* The buffer was not sent so must be freed again. */
            vPortFree( ( void * ) pcPrintString );
        }
    }
    else
    {
      /* The buffer was not sent, so it must be freed. */
      vPortFree((void*)pcPrintString);
    }
  }

  return xLength;
}

#define THINGSPEAK_TOK_CHANNEL_ID   "channel_id"
#define THINGSPEAK_TOK_ENTRY_ID     "entry_id"
#define THINGSPEAK_TOK_FIELD1       "field1"
#define THINGSPEAK_TOK_CREATED_AT   "created_at"

BaseType_t parse_thingspeak_rsp(char* src, uint16_t len)
{
  BaseType_t xStatus;

  uint32_t ulTokenIndex;
  uint32_t ulNumTokens;
  int32_t lNumTokens;

  char* TokenStart;
  uint32_t TokenLen;

  jsmn_parser xJSMNParser;
  jsmntok_t pxTok[JSMN_MAX_TOK]; /* We expect no more than 128 tokens */

  jsmn_init(&xJSMNParser);

  lNumTokens = jsmn_parse(&xJSMNParser, src, len, pxTok, JSMN_MAX_TOK);

  if (lNumTokens < 0) 
  {
    DBG_JSMN("Failed to parse JSON", NULL, NULL)
    xStatus = pdFAIL;
  }

  if(xStatus == pdPASS)
  {
    ulNumTokens = (uint32_t)lNumTokens;

    /* Assume the top-level element is an object */
    if (pxTok[0].type != JSMN_OBJECT) 
    {
      DBG_JSMN("Object expected", NULL, NULL)
      xStatus = pdFAIL;
    }

