argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
    if(xStatus == pdPASS)
    {
      /* Loop over all keys of the root object */
      for (ulTokenIndex = 1; ulTokenIndex < lNumTokens; ulTokenIndex++)
      {

        TokenStart = &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ];
        TokenLen = pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start;

        if (jsoneq(src, &pxTok[ulTokenIndex], THINGSPEAK_TOK_CHANNEL_ID) == pdTRUE) 
        {
          /* We may use strndup() to fetch string value */
          cli_printf("[JSMN] %s: %.*s\r\n", 
            THINGSPEAK_TOK_CHANNEL_ID,
            pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start, 
            &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ]
          );
        } 
        else if (jsoneq(src, &pxTok[ulTokenIndex], THINGSPEAK_TOK_ENTRY_ID) == pdTRUE) 
        {
          /* We may use strndup() to fetch string value */
          cli_printf("[JSMN] %s: %.*s\r\n", 
            THINGSPEAK_TOK_ENTRY_ID,
            pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start, 
            &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ]
          );
        } 
        else if (jsoneq(src, &pxTok[ulTokenIndex], THINGSPEAK_TOK_FIELD1) == pdTRUE) 
        {
          /* We may use strndup() to fetch string value */
          cli_printf("[JSMN] %s: %.*s\r\n", 
            THINGSPEAK_TOK_FIELD1,
            pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start, 
            &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ]
          );
        } 
        else if (jsoneq(src, &pxTok[ulTokenIndex], THINGSPEAK_TOK_CREATED_AT) == pdTRUE) 
        {
          /* We may use strndup() to fetch string value */
          cli_printf("[JSMN] %s: %.*s\r\n", 
            THINGSPEAK_TOK_CREATED_AT,
            pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start, 
            &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ]
          );
        }
        else 
        {
                // cli_printf("Unexpected key: %.*s\r\n", t[i].end-t[i].start, src + t[i].start);
        }
      }
    }
  }

  return xStatus;
}

FRESULT sd_get_free_clusters(FATFS* fs)
{
    FRESULT fr;
    DWORD fre_clust, fre_sect, tot_sect;

    /* Get volume information and free clusters of used drive */
    fr = f_getfree((TCHAR const*)SDPath, &fre_clust, &fs);
    if (fr == FR_OK)
    {
      /* Get total sectors and free sectors */
      tot_sect = (fs->n_fatent - 2) * fs->csize * _MAX_SS;
      fre_sect = fre_clust * fs->csize * _MAX_SS;

      /* Print the free space (assuming 512 bytes/sector) */
      cli_printf("[FatFs] Number of Free Clusters:\r\n");
      cli_printf("\t%8lu KB Used\r\n", (tot_sect - fre_sect)/1024);
      cli_printf("\t%8lu KB Available\r\n", fre_sect/1024);
      cli_printf("\t%8lu KB Total\r\n", tot_sect/1024);
    }
    else
    {
      DBG_FATFS("f_getfree",  &fr, NULL);
    }
    
    return fr;
}

FRESULT read_file_sector(FIL* file, void* dest, FSIZE_t len, UINT* bytesread, UINT index)
{
  FRESULT fr;

  fr = f_open(file, "index.htm", FA_READ);
  if(fr != FR_OK)
  {
    DBG_FATFS("f_open",  &fr, NULL);
  }
  else
  {
    fr = f_lseek(file, (index * len));
    if(fr != FR_OK)
    {
      DBG_FATFS("f_lseek",  &fr, NULL);
    }
    else
    {
      fr = f_read(file, dest, len, bytesread);
      if(fr != FR_OK)
      {
        DBG_FATFS("f_read",  &fr, NULL);
      }
    }
    
    fr = f_close(file);
    if(fr != FR_OK)
    {
      DBG_FATFS("f_close",  &fr, NULL);
    }
  }
  
  return fr;
}

/* Start node to be scanned (***also used as work area***) */
FRESULT sd_scan_files(char* path)
{
    FRESULT fr;
    DIR dir;
    UINT i;
    static FILINFO fno;

    fr = f_opendir(&dir, path);                       /* Open the directory */
    if (fr == FR_OK) {
        for (;;) {
            fr = f_readdir(&dir, &fno);                   /* Read a directory item */
            if (fr != FR_OK || fno.fname[0] == 0) break;  /* Break on error or end of dir */
            if (fno.fattrib & AM_DIR) {                    
                /* It is a directory */
                i = strlen(path);
                sprintf(&path[i], "\t%s (%4d bytes)", fno.fname, fno.fsize);
                fr = sd_scan_files(path);                    /* Enter the directory */
                if (fr != FR_OK) break;
                path[i] = 0;
            }
            else 
            {                                       
                /* It is a file. */
                cli_printf("\t%s  (%4d bytes)\r\n", fno.fname, fno.fsize);
            }
        }
        f_closedir(&dir);
    }

    return fr;
}

static BaseType_t jsoneq(const char *json, const jsmntok_t * const pxTok, const char *s) 
{
  BaseType_t xStatus = pdFALSE;

  uint32_t ulStringSize = (uint32_t)pxTok->end - (uint32_t)pxTok->start;

	if (pxTok->type == JSMN_STRING)
  {
    if (strlen(s) == ulStringSize)
    {
      if (0 == strncmp(&json[pxTok->start], s, ulStringSize)) 
      {
  		  xStatus = pdTRUE;
      }
  	}
  }

	return xStatus;
}

BaseType_t post_thingspeak(lwhttp_request_t* req_ptr, lwhttp_response_t* rsp_ptr, uint8_t data)
{
  /* LwIP PV */
  // struct netif* netif = (struct netif*)argument;
  uint16_t len = 0;
  struct netconn *conn;
  struct netbuf *netbuf = NULL;
  ip4_addr_t remote_ip; 
  BaseType_t xStatus = pdFALSE;
  err_t err;
  
  /* Temp Buffer PV */
  char* temp_buf_data = NULL;
  uint16_t temp_buf_data_len = 0;
  
  /* JSON PV */
  const char* json_data_fmt = "{\"api_key\": \"%s\", \"delta_t\": %d, \"field1\": %d}";
  uint8_t json_data[128];
  uint8_t json_data_len[4];
  
  /* Thingspeak server PV */
  const char* key = "WTN6FH385TCUNDMU";
  const char* server = "api.thingspeak.com";
  const char* url = "/update.json?headers=false";

  DBG_LWIP("Send TCP",  &data, NULL);

  if (DHCP_state == DHCP_ADDRESS_ASSIGNED)
  {
    /* Parse HTTP Body in JSON format */
    sprintf((char *)json_data, json_data_fmt, key, 5, data);  
    len = strlen((char *)json_data);
    sprintf((char *)json_data_len, "%d", len);  
          
    /* Build HTTP Request */
    lwhttp_request_put_request_line(req_ptr, LwHHTP_POST, url);
    lwhttp_request_put_message_header(req_ptr, "Content-Type", "application/json");
    lwhttp_request_put_message_header(req_ptr, "Content-Length", (char *)json_data_len);
    lwhttp_request_put_message_body(req_ptr, (char*)json_data, strlen((char *)json_data));  
          
    DBG_LWIP("JSON Data Sent", &len, json_data);

    /* Run LwHTTP Request Parser */
    lwhttp_request_parse(req_ptr);

