argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
    /* Print the request */
    http_print_msg(req_ptr);

    /* LwIP Connect TCP */
    conn = netconn_new(NETCONN_TCP);       
    if (NULL != conn)
    {
#if 0
      /* Bind a netconn to a specific local IP address and port (optional) */
      err = netconn_bind(conn, &netif->ip_addr, 60);
      if (err != ERR_OK)
      {
        cli_printf("[LwIP] %s --> netconn_bind (ERR = %d)\r\n", err);
      }
      else
#endif
      {
        err  = netconn_gethostbyname(server, &remote_ip);
        if (ERR_OK == err)
        {
          DBG_LWIP(server,  NULL, ip4addr_ntoa((const ip4_addr_t *)&remote_ip));
          
          /* Connect to server */
          err = netconn_connect(conn, &remote_ip, 80); 
          if (ERR_OK == err)
          {
            DBG_LWIP("Connection",  NULL, "OK!");

            /* Get LwHTTP Request Data */
            lwhttp_request_get(req_ptr, &temp_buf_data, &temp_buf_data_len);

            /* Write data to server */
            err = netconn_write(conn, temp_buf_data, temp_buf_data_len, NETCONN_NOFLAG);
            if (ERR_OK == err)
            {
              DBG_LWIP("netconn_write",  &temp_buf_data_len, NULL);

              /* Get pointer to buffer where response data is stored */
              while (( err = netconn_recv(conn, &netbuf)) == ERR_OK)
              {
                  do
                  {
                    /* Get pointer to data and length*/
                    netbuf_data(netbuf, (void**)&temp_buf_data, &temp_buf_data_len);
                    
                    /* LwHTTP write response to parser */
                    lwhttp_response_put(rsp_ptr, (char*)temp_buf_data, temp_buf_data_len);
                  }
                  while (netbuf_next(netbuf) >= 0);

                  /* Free data buffer */
                  netbuf_delete(netbuf);
              }
              
              if ((ERR_OK == err) || (err == ERR_CLSD))
              {
                /* Run LwHTTP Request Parser */
                lwhttp_response_parse(rsp_ptr);

                DBG_LWIP("netconn_recv",  &rsp_ptr->buffer.len, NULL);

                /* If parsed response contains the status line and the body we are OK*/
                if ((rsp_ptr->start_line.status_line.buffer.data != NULL) 
                  && (rsp_ptr->message_body.data != NULL))
                {                  
                  xStatus = pdTRUE;               
                }
              }
              else
              {
                DBG_LWIP("netconn_recv", &err, NULL);
              }
            }
            else
            {
              DBG_LWIP("netconn_write", &err, NULL);
            }
          }
          else
          {
            DBG_LWIP("netconn_connect", &err, NULL);
          }
        }
        else
        {
          DBG_LWIP("netconn_gethostbyname", &err, NULL);
        }
      }
      
      netconn_delete(conn);
    }
    else
    {
      err = ERR_CONN;
      DBG_LWIP("netconn_new",  &err, NULL);
    }    
  }
  else
  {
    DBG_DHCP("Unable to send TCP", &DHCP_state, "DHCP State");
  }

  return err;
}

void Start_SD_Logger_Task(void const * argument)
{
  /* USER CODE BEGIN Start_SD_Logger_Task */
  
  /* Queue PV */
  uint8_t queueData = 0;

  osDelay(100);  

  DBG_RTOS("Start Task",  NULL, NULL);

  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(logQueueHandle, &queueData, 0) == pdTRUE)
    {
      DBG_QUEUE("logQueueHandle",  &queueData, NULL);
      sd_log(queueData);
    }
    else if(xQueueReceive(dumpQueueHandle, &queueData, 0) == pdTRUE)
    {
      DBG_QUEUE("dumpQueueHandle",  NULL, NULL);
      sd_dump();
    }
    else
    {
      osDelay(10);  
    }
  }    
  /* USER CODE END Start_SD_Logger_Task */
}

void Start_CLI_Logger_Task(void const * argument)
{
  /* USER CODE BEGIN Start_CLI_Logger_Task */
  char * pcReceivedString = NULL;

  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(cliLoggerQueueHandle, &pcReceivedString, portMAX_DELAY) == pdPASS)
    {
      if (xSemaphoreTake(cliBinarySemHandle, portMAX_DELAY) == pdTRUE)
      {
        cli_write(pcReceivedString, strlen(pcReceivedString));
        xSemaphoreGive(cliBinarySemHandle);
      }
      vPortFree((void*)pcReceivedString);
    }
  }
  /* USER CODE END Start_CLI_Logger_Task */
}

void http_print_msg(lwhttp_message_t* msg)
{
  /* Temp Buffer PV */
  char* temp_buf_data = NULL;
  uint16_t temp_buf_data_len = 0;
  const char* line = "--------------------------------------------------------------";

  cli_printf("%s", line);
  cli_dump(msg->buffer.data, msg->buffer.len);
  cli_printf("%s", line);
}

void Start_HTTP_Client_Task(void const * argument)
{
  /* USER CODE BEGIN Start_HTTP_Client_Task */
  
  /* Queue PV */
  uint8_t queueData = 0;
  lwhttp_message_header_t* content_type_header_ptr;

  static lwhttp_request_t client_request;
  static lwhttp_response_t client_response;

  /* Wait for DHCP */
  while (DHCP_state != DHCP_ADDRESS_ASSIGNED)
  {
    DBG_LWIP("Waiting for DHCP",  &DHCP_state, NULL);
    osDelay(500);
  }

  DBG_RTOS("Start Task",  NULL, NULL);

  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(tcpQueueHandle, &queueData, 0) == pdTRUE)
    {
      DBG_QUEUE("tcpQueueHandle", &queueData, NULL);

      /* LwHTTP Inits */
      lwhttp_request_init(&client_request);
      lwhttp_response_init(&client_response);  

      /* Sen POST request */
      if (pdTRUE == post_thingspeak(&client_request, &client_response, queueData))
      {
        http_print_msg(&client_response);

        /* If HTTP Status Code is OK (200) and Content-Type is JSON */
        if ((0 == strncmp(client_response.start_line.status_line.status_code.data, "200", strlen("200"))) 
            && (0 == strncmp(content_type_header_ptr->field_value.data, "application/json", strlen("application/json")))
            && (1 < client_response.message_body.len))
        {
          /* Parse LwHTTP Response message body as JSON */   
          if (parse_thingspeak_rsp(client_response.message_body.data, client_response.message_body.len) == pdTRUE)
          {
            DBG_LWIP("Request FINISHED", NULL, NULL);
          }
        }   
        else
        {
          DBG_LWIP("Invalid response", NULL, NULL);
        }
      }
      else
      {
        DBG_LWIP("Failed to POST", NULL, NULL);
      }

      /* Free LwHTTP Request & Response */
      lwhttp_request_free(&client_request);
      lwhttp_response_free(&client_response);    
    }
    else
    {
      osDelay(10);  
    }
  }    
  /* USER CODE END Start_HTTP_Client_Task */
}

void Start_HTTP_Server_Task(void const * argument)
{
  /* USER CODE BEGIN Start_HTTP_Server_Task */
  static lwhttp_request_t server_request;
  static lwhttp_response_t server_response;
  
  static uint8_t server_response_buffer[64];
  
  UINT bytes_read = 0;
  FRESULT fr;
  FILINFO fno;

  /* LwIP PV */
  struct netconn *conn, *newconn;
  struct netbuf *netbuf = NULL;
  err_t err, accept_err;
  
  /* Temp Buffer PV */
  char* temp_buf_data = NULL;
  uint16_t temp_buf_data_len = 0;
  
  const char* hello_world = "Hello World!"; 
  
  uint8_t content_length[6];
  
  /* Wait for DHCP */
  while (DHCP_state != DHCP_ADDRESS_ASSIGNED)
  {
    DBG_LWIP("Waiting for DHCP",  &DHCP_state, NULL);
    osDelay(500);
  }
  DBG_RTOS("Start Task",  NULL, NULL);
  
  /* Create a new TCP connection handle */
  conn = netconn_new(NETCONN_TCP);
  if (conn!= NULL)
  {
    /* Bind to port 80 (HTTP) with default IP address */
    err = netconn_bind(conn, NULL, 80);
    
